Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/drv/isp/3915/rts_camera/rts_camera_soc_3915_regs.h
/*
 * Realtek Semiconductor Corp.
 *
 * rts_camera_soc_3915_regs.h
 *
 * Copyright (C) 2019      Wil_shi<wil_shi@realsil.com.cn>
 */
#ifndef _RTS_CAMERA_SOC_REGS_H
#define _RTS_CAMERA_SOC_REGS_H

/* register address */

#define RTS_REG_ISP_STREAM_EN_BASE			0x00000000
#define RTS_REG_ISP_STREAM_RST_BASE			0x00000030
#define RTS_REG_YUV_FRAME_BUFFER_STATUS_BASE		0x00000080
#define RTS_REG_YUV_FRAME_Y_START_ADDRESS_BASE		0x000000C0
#define RTS_REG_YUV_FRAME_UV_START_ADDRESS_BASE		0x000000D0
#define RTS_REG_YUV_FRAME_START_ADDRESS_INTERVAL	32
#define RTS_REG_YUV_FRAME_BUFFER_COUNT			0x00000180
#define RTS_REG_YUV_INTERLEAVE_SELECT			0x00000074
#define RTS_REG_ISP_NV12_SELECT				0x00000070

#define RTS_REG_YUV_AXI_BUF_CONFIG_BASE			0x000001A0
#define RTS_REG_YUV_AXI_Y_BUF_CONFIG_S0			\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*0)
#define RTS_REG_YUV_AXI_UV_BUF_CONFIG_S0		\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*1)
#define RTS_REG_YUV_AXI_Y_BUF_CONFIG_S1			\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*2)
#define RTS_REG_YUV_AXI_UV_BUF_CONFIG_S1		\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*3)
#define RTS_REG_YUV_AXI_Y_BUF_CONFIG_S2			\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*4)
#define RTS_REG_YUV_AXI_UV_BUF_CONFIG_S2		\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*5)
#define RTS_REG_YUV_AXI_Y_BUF_CONFIG_S3			\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*6)
#define RTS_REG_YUV_AXI_UV_BUF_CONFIG_S3		\
				(RTS_REG_YUV_AXI_BUF_CONFIG_BASE + 4*7)
#define RTS_REG_YUV_FRAME_LEN_Y_BASE			0x000002A0
#define RTS_REG_YUV_FRAME_LEN_UV_BASE			0x000002A4
#define RTS_REG_YUV_FRAME_LEN_INTERVAL			8
#define RTS_REG_YUV_Y_CUR_FRAME_INDEX_OFFSET_BASE	0x000001D0
#define RTS_REG_YUV_CUR_FRAME_INDEX_OFFSET_INTERVAL	8

#define RTS_REG_INT_EN_ISP_TO_HOST			0x00000250
#define RTS_REG_INT_FLAG_ISP_HOST			0x00000254

#define RTS_REG_INT_EN_RGB_YONLY_TO_HOST		0x00000260
#define RTS_REG_INT_FLAG_RGB_YONLY_HOST			0x00000264
#define RTS_REG_ISP_RGB_YONLY_STREAM_EN			0x00000010
#define RTS_REG_ISP_RGB_YONLY_STREAM_RST		0x00000040
#define RTS_REG_RGB_YONLY_FRAME_BUFFER_STATUS		0x00000090
#define RTS_REG_RGB_R_FRAME_START_ADDRESS_BASE		0x00000140
#define RTS_REG_RGB_G_FRAME_START_ADDRESS_BASE		0x00000150
#define RTS_REG_RGB_B_FRAME_START_ADDRESS_BASE		0x00000160
#define RTS_REG_RGB_YONLY_FRAME_BUFFER_COUNT		0x00000188
#define RTS_REG_RGB_R_AXI_BUF_CONFIG			0x000001C0
#define RTS_REG_RGB_G_AXI_BUF_CONFIG			0x000001C4
#define RTS_REG_RGB_B_AXI_BUF_CONFIG			0x000001C8
#define RTS_REG_RGB_AXI_BUF_CONFIG_INTERVAL		4
#define RTS_REG_RGB_FRAME_LEN_R				0x000002C0
#define RTS_REG_RGB_FRAME_LEN_G				0x000002C4
#define RTS_REG_RGB_FRAME_LEN_B				0x000002C8

#define RTS_REG_RGB_R_CUR_FRAME_INDEX_OFFSET		0x000001F0

#define RTS_REG_INT_FLAG_FRAME0_VALID_STATUS		((u32)0x00000001 << 3)
#define RTS_REG_INT_FLAG_FRAME1_VALID_STATUS		((u32)0x00000001 << 7)
#define RTS_REG_INT_FLAG_FRAME2_VALID_STATUS		((u32)0x00000001 << 11)
#define RTS_REG_INT_FLAG_FRAME3_VALID_STATUS		((u32)0x00000001 << 15)


#define RTS_REG_INT_FLAG_RGB_FRAME0_VALID_STATUS	((u32)0x00000001 << 4)
#define RTS_REG_INT_FLAG_RGB_FRAME1_VALID_STATUS	((u32)0x00000001 << 12)
#define RTS_REG_INT_FLAG_RGB_FRAME2_VALID_STATUS	((u32)0x00000001 << 20)





#endif
